s60sc/ESP32-CAM_MJPEG2SD/src/motionDetect.cpp

/* 
 Detect movement in sequential images using background subtraction.
 
 Very small (96x96) bitmaps are used both to provide image smoothing to reduce spurious motion changes 
 and to enable rapid processing
 Bitmaps can either be color or grayscale. Color requires triple memory
 of grayscale and more processing.

 The amount of change between images will depend on the frame rate.
 A faster frame rate will need a higher sensitivity

 When frame size is changed the OV2640 outputs a few glitched frames whilst it 
 makes the transition. These could be interpreted as spurious motion.

 Machine Learning can be incorporated to further discriminate when motion detection 
 has occurred by classifying whether the object in the frame is of a particular
 type of interest, eg a human, animal, vehicle etc. 
 
 s60sc 2020, 2023, 2025
*/

#include "appGlobals.h"

#if INCLUDE_TINYML
#include TINY_ML_LIB
#endif

#define INACTIVE_COLOR 96 // color for inactive motion pixel
#define JPEG_QUAL 80 // % quality for generated motion detect jpeg
  
// motion recording parameters
bool dbgMotion = false;
int detectMotionFrames = 5; // min sequence of changed frames to confirm motion 
int detectNightFrames = 10; // frames of sequential darkness to avoid spurious day / night switching
// define region of interest, ie exclude top and bottom of image from movement detection if required
// divide image into detectNumBands horizontal bands, define start and end bands of interest, 1 = top
int detectNumBands = 10;
int detectStartBand = 3;
int detectEndBand = 8; // inclusive
int detectChangeThreshold = 15; // min difference in pixel comparison to indicate a change
uint8_t colorDepth; // set by depthColor config
static size_t stride;
bool mlUse = false; // whether to use ML for motion detection, requires INCLUDE_TINYML to be true
float mlProbability = 0.8; // minimum probability (0.0 - 1.0) for positive classification

uint8_t lightLevel; // Current ambient light level 
uint8_t nightSwitch = 20; // initial white level % for night/day switching
float motionVal = 8.0; // initial motion sensitivity setting
uint8_t* motionJpeg = NULL;
size_t motionJpegLen = 0;
static uint8_t* currBuff = NULL;

#ifndef AUXILIARY

#if INCLUDE_NEW_JPG
// use esp_new_jpeg library instead of built in
// uses more memory as not hard coded into ROM
// download latest repo from https://components.espressif.com/components/espressif/esp_new_jpeg
// convert to arduino library as per https://github.com/s60sc/ESP32-CAM_MJPEG2SD/discussions/661#discussioncomment-14507339
#include "esp_jpeg_dec.h"
#include "esp_jpeg_enc.h"

struct esp_jpeg_stream {
    jpeg_dec_handle_t       jpeg_dec;
    jpeg_dec_io_t*          jpeg_io;
    jpeg_dec_header_info_t* out_info;
    jpeg_pixel_format_t     output_type;
};
typedef struct esp_jpeg_stream* esp_jpeg_stream_handle_t;

static void jpgReduce(int inWidth, int inHeight, uint8_t downsize, int* outWidth, int* outHeight);
static bool jpg2rgbOpen(esp_jpeg_stream_handle_t jpegHandle, uint16_t width, uint16_t height);
static bool jpg2rgb(esp_jpeg_stream_handle_t jpegHandle, uint8_t* inputBuf, int inputLen, uint8_t* outputBuf);
static bool jpg2rgbClose(esp_jpeg_stream_handle_t jpegHandle);
static size_t rgb2jpg(uint8_t* rgb888, int width, int height, int qual, uint8_t* outputBuf);
#else
// built in
static bool jpg2rgb(const uint8_t* src, size_t src_len, uint8_t* out, uint8_t scale);
#endif

/**********************************************************************************/


bool isNight(uint8_t nightSwitch) {
  // check if night time for suspending recording
  // or for switching relay if enabled
  static bool nightTime = false;
  static uint16_t nightCnt = 0;
  if (nightTime) {
    if (lightLevel > nightSwitch) {
      // light image
      if (nightCnt > 0) nightCnt--;
      // signal day time after given sequence of light frames
      if (nightCnt == 0) {
        nightTime = false;
        LOG_INF("Day time");
      }
    }
  } else {
    if (lightLevel < nightSwitch) {
      // dark image
      nightCnt++;
      // signal night time after given sequence of dark frames
      if (nightCnt > detectNightFrames) {
        nightTime = true;     
        nightCnt = detectNightFrames;           
        LOG_INF("Night time"); 
      }
    } else {
      // back to light while not yet in nightTime: reset counter
      if (nightCnt > 0) nightCnt--;
    }
  } 
  return nightTime;
}

// Bilinear interpolation of four neighboring pixels using 16‑bit fixed‑point fractions
static inline uint8_t interpolatePixel(
    uint8_t a, uint8_t b, uint8_t c, uint8_t d,
    uint32_t xFrac8, uint32_t yFrac8)
{
    constexpr uint32_t FRACTION_TO_8BIT_SHIFT = 8;
    constexpr uint32_t ROUNDING_OFFSET = 0x8000; // midpoint rounding for 16‑bit fixed‑point
    constexpr int32_t MIN_COLOR_VALUE = 0;
    constexpr int32_t MAX_COLOR_VALUE = 255;
    constexpr uint32_t FIXED_POINT_SHIFT = 16;

    // Convert 8‑bit samples to signed 32‑bit for arithmetic
    const int32_t val_a = a;
    const int32_t val_b = b;
    const int32_t val_c = c;
    const int32_t val_d = d;

    // Convert fractional inputs to signed 32‑bit
    const int32_t xFrac = static_cast<int32_t>(xFrac8);
    const int32_t yFrac = static_cast<int32_t>(yFrac8);

    // Horizontal deltas for top and bottom rows
    const int32_t diff_ab = val_b - val_a;
    const int32_t diff_cd = val_d - val_c;

    // Horizontal interpolation of top and bottom rows in 8‑bit fixed‑point
    const int32_t top = (val_a << FRACTION_TO_8BIT_SHIFT) + diff_ab * xFrac;
    const int32_t bot = (val_c << FRACTION_TO_8BIT_SHIFT) + diff_cd * xFrac;

    // Vertical interpolation between top and bottom
    const int32_t diffY = bot - top;
    const int32_t res = (top << FRACTION_TO_8BIT_SHIFT) + (diffY * yFrac);

    // Convert back to 8‑bit with rounding
    const int32_t final_val = (res + ROUNDING_OFFSET) >> FIXED_POINT_SHIFT;

    // Clamp to valid color range
    return static_cast<uint8_t>(
        final_val > MAX_COLOR_VALUE ? MAX_COLOR_VALUE :
        (final_val < MIN_COLOR_VALUE ? MIN_COLOR_VALUE : final_val));
}

// Rescales an image using bilinear interpolation with fixed‑point stepping
static void rescaleImage(const uint8_t* input, int inputWidth, int inputHeight,
    uint8_t* output, int outputWidth, int outputHeight,
    uint8_t colorDepth)
{
    // Minimum valid parameters and fixed‑point constants
    constexpr int MIN_VALID_DIMENSION = 1;
    constexpr int MIN_VALID_COLOR_DEPTH = 1;
    constexpr uint32_t FIXED_POINT_SHIFT = 16;
    constexpr uint32_t FIXED_POINT_MASK = 0xFFFF;
    constexpr uint32_t FRACTION_TO_8BIT_SHIFT = 8;
    constexpr uint32_t FRACTION_8BIT_MASK = 0xFF;
    constexpr uint8_t RGB_COLOR_DEPTH = 3;
    constexpr uint32_t ADJACENT_PIXEL_OFFSET = 1;

