s60sc/ESP32-CAM_MJPEG2SD/src/motionDetect.cpp
    // Reject invalid buffers or dimensions
    if (!input || !output ||
        inputWidth < MIN_VALID_DIMENSION || inputHeight < MIN_VALID_DIMENSION ||
        outputWidth < MIN_VALID_DIMENSION || outputHeight < MIN_VALID_DIMENSION ||
        colorDepth < MIN_VALID_COLOR_DEPTH) {
        return;
    }

    // Fast path: identical dimensions → direct copy
    if (inputWidth == outputWidth && inputHeight == outputHeight) {
        if (input != output) {
            const size_t totalBytes =
                static_cast<size_t>(inputWidth) *
                static_cast<size_t>(inputHeight) *
                colorDepth;
            memcpy(output, input, totalBytes); // raw block copy
        }
        return;
    }

    // Compute fixed‑point scaling increments for X/Y
    const uint32_t xStep =
        (static_cast<uint32_t>(inputWidth) << FIXED_POINT_SHIFT) /
        static_cast<uint32_t>(outputWidth);
    const uint32_t yStep =
        (static_cast<uint32_t>(inputHeight) << FIXED_POINT_SHIFT) /
        static_cast<uint32_t>(outputHeight);

    // Last valid source pixel index for bilinear lookup
    const uint32_t max_y = static_cast<uint32_t>(inputHeight) - ADJACENT_PIXEL_OFFSET;
    const uint32_t max_x = static_cast<uint32_t>(inputWidth) - ADJACENT_PIXEL_OFFSET;

    // Byte stride per row for input/output
    const size_t rowStride = static_cast<size_t>(inputWidth) * colorDepth;
    const size_t outRowStride = static_cast<size_t>(outputWidth) * colorDepth;

    const size_t colorDepthSz = colorDepth; // avoid repeated casts

    // Single‑channel grayscale path
    if (colorDepth == MIN_VALID_COLOR_DEPTH) {
        uint32_t yPos = 0;
        for (int i = 0; i < outputHeight; ++i) {
            const uint32_t yL = yPos >> FIXED_POINT_SHIFT; // source row low
            const uint32_t yFrac8 =
                (yPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT; // vertical fraction
            uint32_t yH = yL + ADJACENT_PIXEL_OFFSET;
            yH = (yH > max_y) ? max_y : yH; // clamp high row

            const uint8_t* rowL = input + static_cast<size_t>(yL) * rowStride;
            const uint8_t* rowH = input + static_cast<size_t>(yH) * rowStride;
            uint8_t* outRow = output + static_cast<size_t>(i) * outRowStride;

            uint32_t xPos = 0;
            for (int j = 0; j < outputWidth; ++j) {
                const uint32_t xL = xPos >> FIXED_POINT_SHIFT; // source col low
                const uint32_t xFrac8 =
                    (xPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT; // horizontal fraction
                uint32_t xH = xL + ADJACENT_PIXEL_OFFSET;
                xH = (xH > max_x) ? max_x : xH; // clamp high col

                // Four neighboring grayscale samples
                const uint8_t* pLL = rowL + xL;
                const uint8_t* pLH = rowL + xH;
                const uint8_t* pHL = rowH + xL;
                const uint8_t* pHH = rowH + xH;

                outRow[j] = interpolatePixel(
                    *pLL, *pLH, *pHL, *pHH, xFrac8, yFrac8); // bilinear sample

                xPos += xStep; // advance horizontal position
            }
            yPos += yStep; // advance vertical position
        }
    }
    // 3‑channel RGB path with optimized pointer increments
    else if (colorDepth == RGB_COLOR_DEPTH) {
        uint32_t yPos = 0;

        for (int i = 0; i < outputHeight; ++i) {
            const uint32_t yL = yPos >> FIXED_POINT_SHIFT;
            const uint32_t yFrac8 =
                (yPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT;

            uint32_t yH = yL + ADJACENT_PIXEL_OFFSET;
            yH = (yH > max_y) ? max_y : yH;

            const uint8_t* rowL = input + static_cast<size_t>(yL) * rowStride;
            const uint8_t* rowH = input + static_cast<size_t>(yH) * rowStride;
            uint8_t* outRow = output + static_cast<size_t>(i) * outRowStride;

            uint32_t xPos = 0;

            for (int j = 0; j < outputWidth; ++j) {
                const uint32_t xL = xPos >> FIXED_POINT_SHIFT;
                const uint32_t xFrac8 =
                    (xPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT;

                uint32_t xH = xL + ADJACENT_PIXEL_OFFSET;
                xH = (xH > max_x) ? max_x : xH;

                // Correct LL/HL pointers (based on xL)
                const uint8_t* pLL = rowL + static_cast<size_t>(xL) * RGB_COLOR_DEPTH;
                const uint8_t* pHL = rowH + static_cast<size_t>(xL) * RGB_COLOR_DEPTH;

                // Correct LH/HH pointers (based on xH)
                const uint8_t* pLH = rowL + static_cast<size_t>(xH) * RGB_COLOR_DEPTH;
                const uint8_t* pHH = rowH + static_cast<size_t>(xH) * RGB_COLOR_DEPTH;

                uint8_t* pOut = outRow + static_cast<size_t>(j) * RGB_COLOR_DEPTH;

                // Per‑channel bilinear interpolation
                pOut[0] = interpolatePixel(pLL[0], pLH[0], pHL[0], pHH[0], xFrac8, yFrac8); // R
                pOut[1] = interpolatePixel(pLL[1], pLH[1], pHL[1], pHH[1], xFrac8, yFrac8); // G
                pOut[2] = interpolatePixel(pLL[2], pLH[2], pHL[2], pHH[2], xFrac8, yFrac8); // B

                xPos += xStep;
            }

            yPos += yStep;
        }
    }
    // Generic multi‑channel path for arbitrary colorDepth
    else {
        uint32_t yPos = 0;
        for (int i = 0; i < outputHeight; ++i) {
            const uint32_t yL = yPos >> FIXED_POINT_SHIFT;
            const uint32_t yFrac8 =
                (yPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT;
            uint32_t yH = yL + ADJACENT_PIXEL_OFFSET;
            yH = (yH > max_y) ? max_y : yH;

            const uint8_t* rowL = input + static_cast<size_t>(yL) * rowStride;
            const uint8_t* rowH = input + static_cast<size_t>(yH) * rowStride;
            uint8_t* outRow = output + static_cast<size_t>(i) * outRowStride;

            uint32_t xPos = 0;
            for (int j = 0; j < outputWidth; ++j) {
                const uint32_t xL = xPos >> FIXED_POINT_SHIFT;
                const uint32_t xFrac8 =
                    (xPos & FIXED_POINT_MASK) >> FRACTION_TO_8BIT_SHIFT;
                uint32_t xH = xL + ADJACENT_PIXEL_OFFSET;
                xH = (xH > max_x) ? max_x : xH;

                // Byte offsets for multi‑channel pixels
                const size_t xL_off = static_cast<size_t>(xL) * colorDepthSz;
                const size_t xH_off = static_cast<size_t>(xH) * colorDepthSz;
                const size_t j_off = static_cast<size_t>(j) * colorDepthSz;

                // Four neighboring multi‑channel pixels
                const uint8_t* pLL = rowL + xL_off;
                const uint8_t* pLH = rowL + xH_off;
                const uint8_t* pHL = rowH + xL_off;
                const uint8_t* pHH = rowH + xH_off;

